<a href="https://colab.research.google.com/github/archelsea/pandas/blob/main/05.Create_new_columns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
air_quality = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_no2.csv')
air_quality.head(2)

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0

# 기존 컬럼에 숫자 곱하기

In [4]:
air_quality['london_mg_per_cubic']=air_quality['station_london'] * 1.882

In [5]:
air_quality.head(2)

              datetime  station_antwerp  ...  station_london  london_mg_per_cubic
0  2019-05-07 02:00:00              NaN  ...            23.0               43.286
1  2019-05-07 03:00:00             50.5  ...            19.0               35.758

[2 rows x 5 columns]

In [6]:
air_quality['test'] = 1.882
air_quality

                 datetime  station_antwerp  ...  london_mg_per_cubic   test
0     2019-05-07 02:00:00              NaN  ...               43.286  1.882
1     2019-05-07 03:00:00             50.5  ...               35.758  1.882
2     2019-05-07 04:00:00             45.0  ...               35.758  1.882
3     2019-05-07 05:00:00              NaN  ...               30.112  1.882
4     2019-05-07 06:00:00              NaN  ...                  NaN  1.882
...                   ...              ...  ...                  ...    ...
1030  2019-06-20 22:00:00              NaN  ...                  NaN  1.882
1031  2019-06-20 23:00:00              NaN  ...                  NaN  1.882
1032  2019-06-21 00:00:00              NaN  ...                  NaN  1.882
1033  2019-06-21 01:00:00              NaN  ...                  NaN  1.882
1034  2019-06-21 02:00:00              NaN  ...                  NaN  1.882

[1035 rows x 6 columns]

### element_wise 기능이 좋은 점은?

아래와 같이 복잡한 작업을 위와 같이 쉽게 처리해주기 때문!

In [7]:
a = [1,2,3,4]
a

[1, 2, 3, 4]

In [8]:
a*2

[1, 2, 3, 4, 1, 2, 3, 4]

In [9]:
b = []

for i in a:
  b.append(i*2)

In [10]:
b

[2, 4, 6, 8]

# 컬럼끼리 연산하기

In [11]:
air_quality['ratio_paris_antwerp'] = air_quality['station_paris'] / air_quality['station_antwerp']
air_quality

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

# 컬럼 이름 수정

In [17]:
# air_quality.rename(columns={'station_london':'FR04014'})  이렇게만 하면 air_quality 프레임 자체가 바뀐 것은 아니기 때문에 덮어 씌우거나 새로운 df를 지칭해줘야 함
air_quality_renamed = air_quality.rename(columns={'station_london':'FR04014'})
air_quality_renamed

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

In [21]:
air_quality_renamed_upper = air_quality.rename(columns=str.upper) # columns을 전부 대문자로 바꿔줌, 소문자로 바꾸고 싶으면 lower
air_quality_renamed_upper

                 DATETIME  STATION_ANTWERP  ...   TEST  RATIO_PARIS_ANTWERP
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

# 특정 컬럼 삭제하기

In [23]:
df = air_quality.drop(['station_antwerp','station_london'],axis=1)
df.head(2)

              datetime  station_paris  ...   test  ratio_paris_antwerp
0  2019-05-07 02:00:00            NaN  ...  1.882                  NaN
1  2019-05-07 03:00:00           25.0  ...  1.882              0.49505

[2 rows x 5 columns]

# 특정 로우 삭제하기

In [25]:
air_quality.shape

(1035, 7)

In [26]:
df = air_quality.drop([0,1],axis=0) # 0,1인덱스를 가지는 것을 삭제하고 싶음, axis=0은 default니까 써도되고 안써도 됨

In [27]:
df

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
5     2019-05-07 07:00:00              NaN  ...  1.882                  NaN
6     2019-05-07 08:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1033 rows x 7 columns]

# 중복 데이터 삭제하기

In [28]:
df = air_quality.drop_duplicates()

In [29]:
df_1 = pd.DataFrame({'one':[1,2,1], 'two':[0,0,0]})
df_1

   one  two
0    1    0
1    2    0
2    1    0

In [30]:
df_1.drop_duplicates()

   one  two
0    1    0
1    2    0